Write anpython code  to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.

The query result format is in the following example.

## Exercise:

In this exercise, you'll calculate the bonus for each employee using the given rules and create a new pandas DataFrame to display the results.

Instructions:

    Read the Employees data into a pandas DataFrame called df.
    Create a function called calculate_bonus that takes an employee_id, name, and salary as input and returns the bonus according to the given rules.
    Use the apply function to apply the calculate_bonus function to each row of df, creating a new column called 'bonus'.
    Sort the DataFrame by the 'employee_id' column.
    Display the result DataFrame with 'employee_id' and 'bonus' columns.

In [1]:
import pandas as pd

# Sample data
data = {'employee_id': [2, 3, 7, 8, 9],
        'name': ['Meir', 'Michael', 'Addilyn', 'Juan', 'Kannon'],
        'sal': [3000, 3800, 7400, 6100, 7700]}

In [7]:
df = pd.DataFrame(data)
df

   employee_id     name   sal
0            2     Meir  3000
1            3  Michael  3800
2            7  Addilyn  7400
3            8     Juan  6100
4            9   Kannon  7700

In [3]:
df.describe()

       employee_id         sal
count     5.000000     5.00000
mean      5.800000  5600.00000
std       3.114482  2115.41958
min       2.000000  3000.00000
25%       3.000000  3800.00000
50%       7.000000  6100.00000
75%       8.000000  7400.00000
max       9.000000  7700.00000

In [4]:
df.dtypes

employee_id     int64
name           object
sal             int64
dtype: object

In [5]:
df.columns

Index(['employee_id', 'name', 'sal'], dtype='object')

In [10]:
def calculate_bonus(row):
    employee_id = row['employee_id']
    name = row['name']
    bonus = row['sal']
    if employee_id % 2 == 1 and not name.startswith('M'):
        return bonus
    else:
        return 0

In [12]:
df['bonus'] = df.apply(calculate_bonus, axis=1)

In [13]:
df[['employee_id', 'bonus']]

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700